# SetCompSecFillChgPt

## Description
Sets the wall associated section fill change point of a component in an object.

```pascal
FUNCTION SetCompSecFillChgPt(
				object                               : HANDLE;
				componentIndex                       : INTEGER;
				wallAssociatedSectionFillChangePoint : INTEGER): BOOLEAN;
```

```python
def vs.SetCompSecFillChgPt(object, componentIndex, wallAssociatedSectionFillChangePoint):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object. Can be a roof face, roof, Roof Style, or the Roof Preferences.|
|componentIndex|INTEGER|The index of the component.|
|wallAssociatedSectionFillChangePoint|INTEGER|The wall associated section fill change point of the component.  0 - Inner face 1 - Outer face of inner component 2 - Inner face of core 3 - Center of core 4 - Outer face of core 5 - Inner face of outer component 6 - None|

## See Also
VS Functions:
GetCompSecFillChgPt

## Version
Availability: from Vectorworks 2016

## Category
* Objects - Architectural